Repository: fredb219/perroquet-website
Catalog: po/*.po
Languages: fr

source: Media type (video, audio, ...):
fr: Type de fichier multimédia (vidéo, audio, ...):

source: Exercise version:
fr: Version de l'exercice :

source: Author:
fr: Auteur :

source: Author website:
fr: Site web de l'auteur :

source: Author contact:
fr: Contact de l'auteur :

source: Packager website:
fr: Site web du packager :

source: Packager contact:
fr: Contact du packager :

source: Translation (en, fr, ...):
fr: Traduction (en, fr, ...) :

source: Package file:
fr: Fichier du paquet :

source: Documentation - Shortcuts
fr: Documentation - Raccourcis

source: These shortcuts are available when the focus is on the response area, ie there is a cursor:
fr: Ces raccourcis sont disponibles quand le focus est dans la zone de réponse, c'est-à-dire, s'il y a un curseur.

source: F1 : Hint
fr: F1 : Indice

source: shift+F1 : Reveal the current word
fr: shift+F1 : Révéler le mot courant

source: ctrl+shift+F1 : Reveal the current sequence
fr: ctrl+shift+F1 : Révéler la séquence courante

source: F2 : Show/hide translation
fr: F2 : Afficher/Masquer la traduction

source: Enter : Replay sequence
fr: Enter : Rejouer la séquence

source: Page Up : Next sequence suivante
fr: Page Up : Next sequence suivante ERREUR

source: Page Down : Previous sequence
fr: Page bas : Séquence précédante

source: You will find here the documentation of Perroquet. This documentation is far to be complete but don't hesitate to contact us for question.
fr: Vous trouverez ici la documentation de Perroquet. Cette documentation est loin d'être complète mais n'hésitez pas à nous contacter pour poser des questions.

source: This documentation is subdivised in six section:
fr: Cette documentation est subdivisée en six sections :

source: <a href="%s">Installation</a> : explains how install, compile or only run perroquet.
fr: <a href="%s">Installation</a> : explique comment installer, compiler ou seulement lancer perroquet.

source: <a href="%s">Use perroquet</a> : describe the user interface and explains how to create an simple exercise and work on it.
fr: <a href="%s">Utiliser perroquet</a> : décrit l'interface utilisateur et explique comment créer un exercice simple et travailler avec.

source: <a href="%s">Help tools</a> : if an exercise is too difficult for you, you can use help tools to give you hint or speed down the playback. This part also explain how to increase the difficulty of an exercise.
fr: <a href="%s">Outils d'aide</a> : si un exercice est trop difficile pour vous, vous pouvez utiliser les outils d'aide pour vous donner un indice ou ralentir la vidéo. Cette partie explique aussi comment augmenter la difficulté de l'exercice.

source: <a href="%s">Repositories</a> : this part explain how to add a new exercise source or create it own exercise repository.
fr: <a href="%s">Dépôts</a> : cette partie explique comment ajouter une nouvelle source d'exercices ou créer son propre dépôt d'exercice.

source: <a href="%s">Exercise creation</a> : explains how to create an exercise using advanced features as teacher locks or multi files exercises.
fr: <a href="%s">Création d'exercice</a> : explique comment créer un exercice utilisant des fonctionnalités avancées comme les verrous d'enseignant ou les exercices multi fichiers.

source: <a href="%s">Development</a> : installation from source, code global structure.
fr: <a href="%s">Développement</a> : installation depuis les sources, structure globale du code.

source: There is also 2 special documentation page:
fr: Il y a aussi 2 pages de documentation spéciales :

source: <a href="%s">FAQ</a> : for common or strange questions.
fr: <a href="%s">FAQ</a> : pour les questions récurrentes ou étranges.

source: <a href="%s">Shortcuts</a> : to stop to use the mouse.
fr: <a href="%s">Raccourcis</a> : pour arrêter d'utiliser la souris.

source: No documentation available.
fr: Pas de documentation disponible

source: Documentation - Exercise creation
fr: Documentation - Création d'exercices

source: To create an exercise, click on the button "New exercise" in the tools bar or on "File > New exercise" in the menu bar.
fr: Pour créer un exercice, il faut soit cliquer sur le bouton "Nouvel exercice" dans la barre d'outils, soit cliquer sur "Fichier > Nouvel exercice" dans la barre de menu.

source: A dialog appears with 4 field:
fr: Une boite de dialogue contenant 4 champs apparait :

source: Exercise video or audio: this field must be set to the media file in the language you want to work.
fr: Fichier vidéo ou audio de l'exercice : Ce champ doit pointer vers un fichier vidéo ou audio dont la bande son est dans la langue que vous souhaitez travailler. L'anglais par exemple.

source: Exercise subtitle: this field must be set to the subtitle file corresponding to the media file, in the same language. The subtitles format must be srt.
fr: Sous-titre de l'exercice : Ce champ doit pointer vers un fichier de sous-titres de la même langue que le fichier média, en anglais par exemple.

source: Translation subtitles: this field can be set to another subtitle in another language. This field is optionnal. The subtitles format must be srt.
fr: Sous-titres de traduction : Ce champs est facultatif et doit pointer vers un fichier de sous-titres de la langue de votre champs mais que vous comprenez bien, le français par exemple.

source: Language: language to work. This field determines the list of character you have to guess.
fr: Langue : langue à travailler. Ce champ détermine la liste des caractères que vous aurez à deviner.

source: Once these fields have been filled, click on "ok" button. Interface's components will be activated and the media file will begin to play.
fr: Une fois que ces champs sont remplis, cliquez sur le bouton "Valider". Les composants de l'interfac seront alors activés et le fichier multimédia commencera à être lu.

source: Documentation - Use - Navigate
fr: Documentation - Utiliser - Navigation

source: For the chapter, you can open an exercise. Open the exercise manager (Edit > Exercise Manager), Select "Alison" exercise and click on Install button. Wait the end of the installation of the exercise the click on the Use button.
fr: Pour ce chapitre, vous pouvez ouvrir un exercice. Ouvrez le gestionnaire d'exercice (Édition > Gestionnaire d'exercice), sélectionnez l'exercice "Alison" et cliquez sur le bouton Installer. Attendez la fin de l'installation de l'exercice et cliquez sur le bouton Utiliser.

source: At the right of the exercise slider, you can see the current position and the lenght of the exercise. The first number is the current sequence and the second is the sequence count. For exemple, in the "Alison" exercise, there is 8 sequences and the exercise begin at the first sequence.
fr: À la droite du curseur d'exercice, vous pouvez voir la position courante et la longueur de l'exercice. Le premier nombre représente la première séquence et le second le nombre de séquence. Par exemple, dans l'exercice "Alison", il y a 8 séquences et l'exercice commence à la première séquence.

source: You are not obligated to answer to sequences in order. You can go directly to a sequence using the exercise slider. You can also use the "Previous sequence" and "Next sequence" button but the complete sequence will be skipped.
fr: Il n'est pas obligatoire de répondre à toutes les séquences dans l'ordre. Il est possible de se placer à n'importe quelle endroit de l'exercice grâce au curseur de séquence. Vous pouvez aussi utiliser les boutons "Séquence suivante" et "Séquence précédente" mais dans ce cas, les séquences complètes seront sautés.

source: With the sequence slider, you can listen the end of the current sequence. This is useful to focalise your listening on one word or when sequence are too long.
fr: Grâce au curseur de séquence, il est possible de ne réécouter que la fin d'une séquence, ce qui est pratique pour se focaliser sur un mot en particulier ou pour n'écouter que la fin d'une longue séquence.

source: When the sequences are not completed, it's not easily possible to see the video part located between 2 sequences because Perroquet stop the video at the end of the sequences. When you complete a sequence, Perroquet will not stop the playback at the end of sequence but continue to play until the end of the next uncomplete sequence. If you really want to see the video after an uncomplete sequence, you have to activate the Play/Pause button : Edit > Settings > Advanced tab > Show play and pause buttons. Then wait that the video stop at the and of the uncomplete sequence and use the Play button. Use the repeat button to return at the beginning of the current sequence.
fr: Lorsqu'une séquence n'est pas complète, il n'est pas possible de regarder simplement la partie de la vidéo située entre 2 séquences parce que Perroquet arrête la lecture de vidéo à la fin des séquences. Quand vous complétez une séquence, Perroquet ne va plus stopper la vidéo jusqu'à la fin de la prochaine séquence incomplète. Si vous voulez vraiment regarder la vidéo après une séquence incomplète, vous devez activer les boutons Lecture/Pause : Édition > Préférences > Onglet Avancées > Afficher les boutons de lecture et de pause. Ensuite attendez que la vidéo s'arrête à la fin d'un séquence incomplète et utiliser le bouton Lecture. Utilisez le bouton répéter pour retourner au début de la séquence courante.

source: Documentation - Use
fr: Documentation - Utiliser

source: In this part, you will lear to works with perroquet.
fr: Dans cette partie, vous allez apprendre à travailler avec Perroquet.

source: The principle of perroquet is to transform a vidéo or audio file in a cloze test with the help of a subtitles file.
fr: Le principe de perroquet est de transformer une vidéo ou un fichier audio en un texte à trous à l'aide d'un fichier de sous-titres.

source: Perroquet works with exercises. An exercise is a set of video or audio sequences that we will just call sequences. A sequence last only few seconds and correspond to a part of a dialog. The part of a video without dialogue can be in none sequence.
fr: Perroquet fonctionne avec des exercices. Un exercice est un ensemble de séquences vidéo ou audio que nous appellerons simplement séquences. Une séquence ne dure que quelques secondes et correspond à des dialogues. Les zones d'une vidéo sans dialogues peuvent ne faire partie d'aucune séquence.

source: For each sequence of an exercise, you will listen it then type words you hear. Perroquet show you the number of word to found and show the punctuation, you must complete the cloze test.
fr: Pour chaque séquence d'un exercice, vous l'écoutez puis tapez les mots que vous entendez. Perroquet vous indique le nombre de mots à trouver ainsi que la ponctuation, vous devez complétez le reste à la manière d'un texte à trous.

source: This part is subdivised in three chapters:
fr: Cette partie est divisée en trois chaptitres :

source: <a href="%s">Interface</a> : this chapter descripte the interface.
fr: <a href="%s">Interface</a> : ce chapitre décrit l'interface.

source: <a href="%s">Navigate</a> : this chapter explain how to navigate in an exercise.
fr: <a href="%s">Naviguer</a> : ce chapitre explique comment naviguer dans un exercice.

source: <a href="%s">Works</a> : this chapter explain how to work on an exercise.
fr: <a href="%s">Travailler</a> : ce chapitre explique comment travailler sur un exercice.

source: Documentation - Use - Work
fr: Documentation - Utiliser - Travailler

source: In the response zone, each word you have to found are symbolised by a blue rectangle. Before typing a response you must verify that a cursor is present in the response zone. If no cursor are present, click on the zone.
fr: Dans la zone de réponse, chaque mot que vous avez à trouver est symbolisé par un rectangle bleu. Avant de taper une réponse, vous devez vérifier qu'un curseur est présent dans la zone de réponse. Si aucun curseur n'est présent, cliquez dans la zone.

source: In the response zone, each word you have to found are symbolised by a blue rectangle. Before typing a response you must verify that a cursor is present in the response zone. If no cursor are present, click on the zone near the word you want to type.
fr: Dans la zone de réponse, chaque mot que vous avez à trouver est symbolisé par un rectangle bleu. Avant de taper une réponse, vous devez vérifier qu'un curseur est présent dans la zone de réponse. Si aucun curseur n'est présent, cliquez dans la zone prêt de l'endroit où vous voulez taper.

source: If you place the cursor at the wrong place but the word you type is right, the word will be moved automatically.
fr: Si vous placez le curseur à la mauvaise position mais que le mot tapé est correct, le mot sera automatiquement déplacé à la bonne place.

source: You don't have to uppercase letters, Perroquet ignore case.
fr: Il n'est pas nécessaire de mettre les majuscules aux mots tapés. Perroquet ignore la case.

source: When a word is correct, it is display in green and cannot be modified.
fr: Lorsqu'un mot est entier et correct, il s'affiche en vert et ne peut plus être modifié.

source: To change the current word, you can use arrow keys, the mouse or the space key. These keys will skipped the completed words.
fr: Pour passer de mot en mot, il suffit d'utiliser les flèches directionnelles ou espace. Ces touches placent directement le curseur au mot suivant ou au mot précédant en ignorant toutes les parties non éditables.

source: The punctuation is already displayed so you don't have to type it. However, characters as apostrophe in english exercises have to be guess. In english exercise, characters to find are : "a" to "z", "0" to "9" and "apostrophe".
fr: La ponctuation étant déjà indiquée, il n'est pas nécessaire de la saisir. Cependant, en anglais par exemple, l'apostrophe fait partie des caractères à deviner. Les caractères à deviner en anglais sont donc : "a" à "z", "0" à "9" et "apostrophe".

source: Documentation - Use - Interface
fr: Documentation - Utiliser - Interface

source: Perroquet's user interface has as goal to make easy to navigate between different sequences and inside a sequence. Perroquet doesn't aim to be a great video player but be good to learn foreign languages.
fr: L'interface de Perroquet permet de faciliter la navigation de séquence en séquence et à l'intérieur d'une séquence. La priorité de Perroquet n'est pas d'être un lecteur vidéo mais d'être efficace pour apprendre les langues étrangères.

source: This is the interface with annotation showing the differents components of the interface:
fr: Voici l'interface avec des annotations montrant les différents composants de l'interface :

source: Annotated Perroquet interface
fr: Interface de Perroquet annotée

source: These components are:
fr: Ces composants sont :

source: 1 - Title bar. It display the project name and the current save state of the exercise.
fr: 1 - La barre de titre. Elle contient le nom du projet courant et l'état d'enregistrement de l'exercice.

source: 2 - Menu bar. It permit an access to most of Perroquet's features.
fr: 2 - La barre de menu. Elle permet un accès à la plupart des fonctionnalités de Perroquet.

source: 3 - Tools bar. It permet a fast access to important of Perroquet's features.
fr: 3 - La barre d'outils. Elle permet un accès rapide aux fonctions importantes de Perroquet.

source: 4 - Video zone. The video is displayed in this zone.
fr: 4 - La zone de vidéo. La vidéo s'affiche dans cette zone.

source: 5 - Statistic's zone. It displays informations about exercise progress.
fr: 5 - La zone de statistiques. Elle affiche des informations sur l'avancement de l'exercice.

source: 6 - Filter field. Allow to filter words in words list.
fr: 6 - Le filtre. Il permet de filtrer les mots de la liste de mots (7).

source: 7 - Words list. It contains all words you have to find in the whole exercise.
fr: 7 - La liste de mots. Elle contient la liste de tous les mots à trouver dans l'exercice.

source: 8 - Response zone. It displays the cloze test.
fr: 8 - La zone de réponse. Elle affiche le texte à trous à compléter.

source: 9 - Translation zone. It displays the translation of the current sequence. This zone is hidden by default
fr: 9 - La zone de traduction. Elle affiche la traduction de la séquence courante. Cette zone est masquée par défaut.

source: 10 - Sequence slider. It permit to navigate in the current sequence.
fr: 10 - Le curseur de séquence. Il permet de naviguer dans la séquence courante

source: 11 - Exercise slider. It permit to navigate in the exercise.
fr: 11 - Le curseur d'exercice. Il permet de naviguer dans l'exercice.

source: The tools bar button are (from left to right):
fr: La barre d'outils contient les boutons suivants (de gauche à droite) :

source: New exercise.
fr: Nouvel exercice.

source: Open en exercise.
fr: Ouvrir un exercice.

source: Save the exercise.
fr: Enregistrer l'exercice.

source: Previous sequence.
fr: Séquence précédente.

source: Next sequence.
fr: Séquence suivante.

source: Listen the sequence again.
fr: Réécouter la séquence.

source: Hint.
fr: Indice.

source: Show/hide translation.
fr: Afficher/Masquer la traduction.

source: Show/hide correction.
fr: Afficher/Masquer la correction.

source: Slow down playback.
fr: Ralentir la vitesse de lecture.

source: Exercise properties.
fr: Propriétes de l'exercice.

source: Reset the exercise.
fr: Réinitialiser l'exercice.

source: Use perroquet
fr: Utiliser Perroquet

source: Help tools
fr: Outils d'aide

source: Reporitories
fr: Dépôts

source: Exercise creation
fr: Création d'exercices

source: Development
fr: Développement

source: Documentation - Add new Repository
fr: Documentation - Ajouter un nouveau dépot

source: Documentation - Repositories
fr: Documentation - Dépôts

source: General
fr: Général

source: Where to download Windows version ?
fr: Où télécharger la version pour Windows ?

source: There is no Windows version but only a Linux version.
fr: Il n'y a pas de version pour Windows mais uniquement une pour Linux.

source: However, perroquet use cross platform library will may have a Windows version if someone develop it.
fr: However, perroquet use cross platform library will ERREUR EN ANGLAIS may have a Windows version if someone develop it.

source: Documentation - Developement
fr: Documentation - Développement

source: Perroquet is developed with python, it use GTK (with pyGTK) for the GUI and Gstreamer as media player
fr: Perroquet est développé en Python, il utilise GTK (avec pyGTK) pour l'interface et Gstreamer comme lecteur multimédia

source: Build from sources
fr: Compiler depuis les sources

source: Download and run
fr: Télécharger et exécuter

source: First, download the last development version on launchpad with bazaar:
fr: Tout d'abord, télécharger la dernière version de développement sur launchpad avec bazaar :

source: You can directly run perroquet without any build or install:
fr: Vous pouvez lancer directement Perroquet sans aucune compilation ou installation :

source: Build locales
fr: Compilation des langues

source: Without built, perroquet will be in english. Without install, the best integration with your system will not be available: no icon, no entry in menu, no handle on *.perroquet.
fr: Sans compilation, Perroquet sera en anglais. Sans installation, l'intégration complète avec votre système ne sera pas disponible : pas d'icône, pas d'entré de menu, pas de programme d'ouverture par défaut sur les fichiers *.perroquet.

source: You can build others languages easily:
fr: Vous pouvez compiler les autres langues facilement :

source: The language files should now be build. If you run Perroquet again and if your system language is one of translation language, the text in Perroquet will be translated.
fr: Les fichiers de traduction devraient maintenant être construits. Si vous lancez à nouveau Perroquet et si la langue de votre système est une de celle traduite, le texte dans Perroquet sera traduit.

source: Install
fr: Installer

source: To install perroquet, type with root rigths:
fr: Pour installer Perroquet, tapez avec les droits administrateur :

source: or with sudo
fr: ou avec sudo

source: The install-files.txt file is optionnal. It is needed to uninstall Perroquet.
fr: Le fichier install-files.txt est optionnel. Il est nécessaire pour désinstaller Perroquet.

source: Once installed, you should be able to launch Perroquet from anywhere:
fr: Une fois installé, vous devriez être capable de lancer Perroquet depuis n'importe où :

source: Uninstall
fr: Désinstaller

source: To uninstall perroquet, type with root rigths:
fr: Pour désinstaller Perroquet, tapez avec les droits administrateur :

source: Documentation - Help tools
fr: Documentation - Outils d'aide

source: In some cases, you may fail to understand what is said. Sometimes nothing is said (if there are subtitles for the deaf). Sometimes, the subtitles are broken. In these case, there is multiple ways to get help.
fr: Dans certains cas, il arrive de ne pas réussir à comprendre ce qui est dit, parfois rien n'est dit (s'il y a des sous-titres pour sourd) ou encore il arrive que les sous-titres soient erronés. Dans ce cas, il existe trois moyens de se faire aider.

source: Most of these help tools can be accessed by the help menu.
fr: La plupart de ces outils d'aide sont accessibles depuis le menu Aide.

source: Hint
fr: Indice

source: Translation
fr: Traduction

source: Words list
fr: Liste des mots

source: Complete words
fr: Compléter les mots

source: Show correction
fr: Afficher la correction

source: Perroquet change the background color of words when you are editing a word. If the color turn to green, you are near of the good word. If the color turn to red, you are wrong or misplaced.
fr: Perroquet change la couleur du fond des mots quand vous les éditez. Si la couleur passe au vert, vous êtes près d'avoir un mot correct. Si la couleur passe au rouge, le mot est faux ou mal placé.

source: Click on Hint button will give you help on the word where the cursor is. At first hint, the character count of the word will be displayed with some "~" (you don't have to delete these "~", they will be automaticaly replaced on typing). For each other hint, a new letter of the word will be displayed. Before ask a hint, don't delete your word: the correct character will be preserved.
fr: Appuyer sur le bouton indice va fournir une aide sur le mot en cours d'édition. Au premier indice, le nombre de caractères du mot va être indiqué par des "~" (qu'il est inutile de supprimer, ils seront remplacés automatiquement). À chaque autre indice, une lettre du mot sera complété. Avant de demander le premier indice, ne supprimez pas le mot faux : les bonnes lettres seront conservées.

source: The translation button show or hide the translation zone. If a translation file has been choose at exercise creation, the translation of the current sequence is displayed in the translation zone. Perroquet translate sometimes more text then necessary to be sure the the interresting part is present.
fr: Le bouton traduction permet d'afficher ou de masquer la zone de traduction. Si un fichier de traduction a été choisi à la création d'un exercice, la traduction de la séquence s'affichera dans la zone de traduction. Perroquet traduit parfois plus de texte que nécessaire pour être sûr que la partie intéressante est présente.

source: The words list contains the list of words to find in whole exercise. It can serve to find the exact spell of a word.
fr: La liste des mots contient l'intégralité des mots à trouver dans l'exercice. Cela peut servir à confirmer une orthographe par exemple.
