Repository: fredb219/perroquet-website
Catalog: po/*.po
Languages: fr

source: The filter can help to display less words. To use the filter, you just have to type the pattern in the filter field. The filter use regexp, so typing "^s.{3}r$" select only words of 5 letters beginning with s and ending with "r".
fr: Le filtre permet de sélectionner seulement une partie de la liste de mots. Pour l'utiliser, il suffit de taper une partie du motif à rechercher. Le filtre utilise les expressions régulières, ainsi taper "^s.{3}r$" permettra de sélectionner uniquement les mots de 5 lettres commençant par s et terminant par r.

source: You can complete the current word or the current sequence using "Reveal the word" or "Reveal the sequence" in the help menu.
fr: Vous pouvez compléter le mot ou la phrase courante en utilisant "Révéler le mot" ou "Révéler la séquence" dans le menu Aide.

source: Clicking on the Show correction button, you activate the correction mode. In this mode you show the correction without have to reveal all sequences. Also, you can easily hide the correction.
fr: En cliquant sur le bouton Afficher la correction, vous activez le mode corrigé. Dans ce mode, vous voyez la correction sans avoir à révéler toutes les séquences. Vous pouvez aussi facilement masquer la correction.
