Repository: fredb219/perroquet-website
Catalog: po/*.po
Languages: fr

source: Perroquet — Listening comprehension tutor —
fr: Perroquet — Un assistant à la compréhension orale —

source: Logged as %s
fr: Connecté en tant que %s

source: Change language
fr: Changer la langue

source: Logout
fr: Se déconnecter

source: Login
fr: Se connecter

source: Listening comprehension tutor
fr: Assistant à la compréhension orale

source: Presentation
fr: Présentation

source: Download
fr: Télécharger

source: Screenshots
fr: Captures d'écran

source: Exercises
fr: Exercices

source: Contribute
fr: Contribuer

source: Users list
fr: Liste des utilisateurs

source: Proposed exercises
fr: Exercices proposés

source: Add an exercise
fr: Ajouter un exercice

source: Perroquet in use
fr: Perroquet en cours d'utilisation

source: Perroquet is a educational program to improve playfully your listening in a foreign language
fr: Perroquet est un programme éducatif dont le but est d'améliorer de manière divertissante votre niveau de compréhension orale des langues étrangères

source: How it works
fr: Fonctionnement

source: The principe of Perroquet is to use a video or audio file and the associated subtitles to make you listen and understand the dialogue or lyrics. After having idendified the files to use, Perroquet will read a piece of video then pause. It will show you the number of words to find and you will have to type them to continue. You can listen a sequence as many times as necessary. If you do not understand, Perroquet offers several means to help you.
fr: Le principe de Perroquet est d'utiliser une vidéo ou un fichier audio et les sous-titres associés pour vous faire écouter et comprendre les dialogues ou paroles. Après lui avoir indiqué les fichiers à utiliser, Perroquet va lire un morceau de la vidéo et puis la mettre en pause. Il vous indiquera alors le nombre de mots à trouver et vous devrez les taper pour pouvoir continuer la lecture. Il est possible de réécouter une séquence autant de fois que nécessaire. Si vous ne comprenez pas tout, Perroquet présente plusieurs moyens de vous aider.

source: Try now
fr: Tester maintenant

source: Perroquet work with every media file your computer can read. Choose one video ou a audio book in the language you want to work and download the corresponding subtitle in the same language (srt format). <a href="%s" >Download</a>, install and launch perroquet.
fr: Perroquet fonctionne avec n'importe quel fichier multimédia que votre ordinateur est capable de lire. Choisissez une vidéo ou un livre audio dans la langue que vous souhaitez travailler et téléchargez le sous-titre correspondant dans la même langue (format str). <a href="%s" >Téléchargez</a>, installez puis lancez Perroquet.

source: You must download Perroquet, run it, create a new exercise and put the video file in the first field and the subtitles in the same language then video in the second field. To learn to use all the features of Perroquet, see the <a href="%s" >documentation</a>.
fr: Vous devez télécharger Perroquet, le lancer, créer un nouvel exercice et choisir le fichier vidéo pour le premier champ et le sous-titre de la même langue que la vidéo dans le second champ. Pour apprendre à utiliser toutes les fonctionnalités de Perroquet, consultez la <a href="%s" >documentation</a>.

source: If you want to test perroquet but you have no video available, you can use the integrated exercises manager. You can find it in "Edit > Exercices Manager" and provide a easy way to install exercises from a online database.
fr: Si vous voulez tester Perroquet mais que vous n'avez aucune vidéo disponible, vous pouvez utiliser le gestionnaire d'exercices intégré. Vous pouvez le trouver dans "Édition > Gestionnaire d'exercices" et il procure un moyen facile d'installer des exercices depuis une base de donnée en ligne.

source: If you want plan to test perroquet without internet connection, you also can download an exercises now from the online exercise repository and import it in perroquet later (File > Import): <a href="/exercises/" >Exercises repository</a>
fr: Si vous prévoyez tester Perroquet sans connexion internet, vous pouvez aussi télécharger tout de suite un exercice depuis le dépôt d'exercice en ligne et l'importer plus tard dans Perroquet (Fichier > Importer) : <a href="/exercises/" >Exercises repository</a>

source: For now, the online exercises only allows you to practice understanding English.
fr: Pour le moment, les exercices en ligne sont uniquement fait pour pratiquer son anglais.

source: News
fr: Nouveautés

source: No more display subtitles embeded is a mkv file
fr: Les sous-titres inclus dans les fichiers mkv ne sont plus affichés

source: Fix a project loading bug in in progress sequences
fr: Correction d'un bug de chargement de projet avec des séquences partiellement complétées

source: Place the cursor at the end of a moved word
fr: Place le curseur à la fin d'un mot déplacé

source: Fix deletion bug
fr: Correction d'un bug de suppression

source: Fix the cursor position when an alias is used
fr: Correction de la position du curseur quand un alias est utilisé

source: Fix the cursor position whe the last word is completed
fr: Correction de la position du curseur quand le dernier mot est complété

source: Fix the cursor position after using hint
fr: Correction de la position du curseur après l'utilisation d'une aide

source: Fix crash if a config key is missing in the config
fr: Correction d'un crash si une clé de configuration est manquante

source: Update the translation
fr: Mise à jour de la traduction

source: Add repository manager
fr: Ajout du gestionnaire d'exercices

source: Packages import and export
fr: Importation et exportation de paquets

source: Refactoring most of the code
fr: Refactoring de la plupart du code

source: Add others exercise languages
fr: Ajout de la possibilité d'exercices dans d'autres langues que l'anglais

source: Added aliases and synonyms
fr: Ajout d'alias et de synonymes

source: Show last open files
fr: Affichage des derniers fichiers ouverts

source: Add many teaching tools
fr: Ajout de plusieurs outils scolaires

source: Change exercise properties
fr: Edition des réglages des exercices

source: Add many navigation toots
fr: Ajout de plusieurs outils de navigation

source: Add many new help tools
fr: Ajout de plusieurs outils d'aide

source: Support multi files exercises
fr: Support des exercices multi fichiers

source: Automatic move of wrong placed words
fr: Déplacement automatique des mots placés au mauvais endroit

source: Fix various bugs
fr: Plusieurs corrections de bugs

source: Translation updates
fr: Mise à jour des traductions

source: Improve window resize
fr: Amélioration du redimensionnement de la fenêtre

source: Add new shortcuts
fr: Ajout de nouveaux raccourcis

source: Remove html tags in srt files
fr: Suppression des balises HTML dans les fichiers srt

source: Replace | by new line in srt
fr: Remplacement de | par un saut de ligne dans les fichiers srt

source: Handle perroquet file, add mime type and icons on perroquet exercise
fr: Ouverture automatique de Perroquet à l'utilisation d'un fichier d'exercice. Ajout d'icone et de type MIME.

source: Improve exercice creation dialog
fr: Amélioration de la boite de dialogue de création d'exercices

source: Add tooltips
fr: Ajout d'infobulles

source: Reimplement input system to support specials characters
fr: Réimplémentation du système d'entrée clavier pour supporter les caractères spéciaux

source: Perroquet is a free software distributed under the GNU Public License version 3 or higher. The source code of this software is available here: <a href="https://launchpad.net/perroquet/+download" >Download page at launchpad</a>
fr: Perroquet est un logiciel libre distribué sous la licence GNU Public License version 3 ou supérieure. Le code source de ce logiciel est disponible à l'adresse suivante : <a href="https://launchpad.net/perroquet/+download" >Page de téléchargement sur launchpad</a>

source: The full text of the license is available here <a href="http://www.gnu.org/licenses/gpl.html">GPL</a>.
fr: Le texte complet de la licence est disponible ici <a href="http://www.gnu.org/licenses/gpl.html">GPL</a>.

source: Perroquet exercises manager
fr: Gestionnaire d'exercices de Perroquet

source: User list
fr: Liste des utilisateurs

source: Go to login page
fr: Aller à la page d'authentification

source: Administrators
fr: Administrateurs

source: Name
fr: Nom

source: Admin rights
fr: Droits administrateurs

source: Delete
fr: Supprimer

source: Remove
fr: Retirer

source: Users
fr: Utilisateurs

source: Add
fr: Ajouter

source: Perroquet is open to extern contribution. There is a lot of things beside programming that can help us. There is work on the Perroquet software, but also on exercise repository and on this website.
fr: Perroquet est ouvert aux contributions externes. Il y a beaucoup de choses à coté de la programmation qui peuvent nous aider. Il y a du travail sur le logiciel Perroquet, mais aussi sur le dépot d'exercices et sur ce site web.

source: If no special link is provide, please contact us:
fr: Si aucun lien particulier n’est indiqué, contactez-nous :

source: Contact perroquet team</a>.
fr: Contacter l'équipe de Perroquet</a>.

source: Help on Perroquet software
fr: Aider sur le logiciel Perroquet

source: Signal a bug or a translation error in Perroquet: <a href="https://bugs.launchpad.net/perroquet" >Perroquet bugtracker</a>
fr: Signaler un bug ou une erreur de traduction dans Perroquet: <a href="https://bugs.launchpad.net/perroquet" >Bugtracker de Perroquet</a>

source: Packaging or adding in distributions
fr: Packager ou ajouter Perroquet dans des distributions

source: Send a patch: <a href="https://code.launchpad.net/~perroquet-team/perroquet/trunk2" >Perroquet code</a>
fr: Envoyer un patch : <a href="https://code.launchpad.net/~perroquet-team/perroquet/trunk2" >Code de Perroquet</a>

source: Help to translate Perroquet: <a href="https://translations.launchpad.net/perroquet" >Perroquet online translation</a>
fr: Aider à traduire Perroquet: <a href="https://translations.launchpad.net/perroquet" >Traduction en ligne de Perroquet</a>

source: Suggest a new feature or make a suggestion
fr: Suggérer une nouvelle fonctionnalité ou émettre une suggestion

source: Help on exercise repositoy
fr: Aider sur le dépôt d'exercices

source: Signal error on exercise
fr: Signaler une erreur dans un exercice

source: Signal usable video or audio file (with or without subtitles)
fr: Signaler un vidéo ou un fichier audio (avec ou sans sous-titres)

source: Propose an exercise:
fr: Proposer un exercice :

source: propose a new exercise
fr: proposer un nouvel exercice

source: Write subtitles
fr: Rédiger des sous-titres

source: Help on Perroquet website
fr: Aider sur le site web de Perroquet

source: Write documentation
fr: Rédiger de la documentation

source: Signal a bug or a translation error in this website: <a href="https://bugs.launchpad.net/perroquet/website" >Perroquet website bugtracker</a>
fr: Signaler un bug ou une erreur de traduction dans ce site web : <a href="https://bugs.launchpad.net/perroquet/website" >Bugtracker du site web de Perroquet</a>

source: Help to translate the website: <a href="https://translations.launchpad.net/perroquet/website/+translations" >Perroquet website online translation</a>
fr: Aider à traduire le site web : <a href="https://translations.launchpad.net/perroquet/website/+translations" >Site de traduction de Perroquet en ligne</a>

source: Improve this website: <a href="https://code.launchpad.net/~perroquet-team/perroquet/website" >Perroquet website code</a>
fr: Améliorer ce site web : <a href="https://code.launchpad.net/~perroquet-team/perroquet/website" >Code du site web de Perroquet</a>

source: Others helps
fr: Autres formes d'aide

source: All others help is welcome. If you want to participate more to perroquet, you can ask to join the team.
fr: Toutes les autres formes d'aide sont bienvenues. Si vous participez encore plus à Perroquet, vous pouvez demander à intégrer l'équipe.

source: If you want to participate to Perroquet or report a problem, begin to visit the "contribute" page:
fr: Si vous voulez participer à Perroquet ou signaler un problème, commencez par visiter la page "Contribuez" :

source: Contribute to Perroquet
fr: Contribuer à Perroquet

source: For general or public questions: <a href="mailto:perroquet-team@lists.launchpad.net">perroquet-team@lists.launchpad.net</a>.
fr: Pour les questions générales ou publiques : <a href="mailto:perroquet-team@lists.launchpad.net">perroquet-team@lists.launchpad.net</a>.

source: For private questions: <a href="mailto:pfred.bertolus@gmail.com">fred.bertolus@gmail.com</a>.
fr: Pour les questions privées : <a href="mailto:pfred.bertolus@gmail.com">fred.bertolus@gmail.com</a>.

source: Last release :
fr: Dernière sortie :

source: Currently, Perroquet is only available for Linux, but it uses multi-platform technology. It should be easily portable to other systems.
fr: Actuellement, Perroquet n'est disponible que pour Linux, mais il utilise des technologies multiplateformes. Il devrait être facilement portable sur d'autres systèmes.

source: Generally, the downloads are available here: <a href="https://launchpad.net/perroquet/+download" >Download page on launchpad</a>.
fr: De manière générale, les téléchargements sont disponibles à l'adresse suivante : <a href="https://launchpad.net/perroquet/+download" >Page de téléchargement sur launchpad</a>.

source: Installer
fr: Installeur

source: Using the installer, you'll miss the updates of Perroquet. If you want to make the updates, install Perroquet with the PPA
fr: En utilisant l'installeur, vous ne profiterez pas des mises à jours de Perroquet. Si vous tenez à profiter des mises à jours, installez Perroquet via le PPA

source: The installer for Ubuntu is available here: <a href="http://launchpad.net/perroquet/1.1/1.1.1/+download/perroquet_1.1.1-0ubuntu1_all.deb" >Ubuntu Perroquet 1.1.1 installer</a>
fr: L'installeur pour Ubuntu est disponible ici : <a href="http://launchpad.net/perroquet/1.1/1.1.1/+download/perroquet_1.1.1-0ubuntu1_all.deb" >Installeur Ubuntu pour Perroquet 1.1.1 </a>

source: It is possible that this link is not updated. Go to this page to see all downloads:<a href="https://launchpad.net/perroquet/+download" >Download page on launchpad</a>
fr: Il est possible que ce lien ne soit pas à jour. Allez sur cette page pour voir tous les téléchargements :<a href="https://launchpad.net/perroquet/+download" >Page de téléchargement launchpad</a>

source: PPA mean Personal Package Archives. Adding the PPA in your ubuntu software sources, Perroquet will be upgraded by the system.
fr: Un PPA (Personal Package Archives) est un dépôt de logiciels personnels. En ajoutant ce dépôt dans la liste des sources de logiciels d'Ubuntu, Perroquet apparaitra dans la liste des logiciels installables et profitera des mises à jours quand elles sont disponibles.

source: The details of the PPA are available at this address: <a href="https://launchpad.net/~fred-bertolus/+archive/perroquet" >PPA Perroquet</a>
fr: Les détails concernant le PPA sont disponibles à cette adresse : <a href="https://launchpad.net/~fred-bertolus/+archive/perroquet" >PPA Perroquet</a>

source: An AUR package is available here: <a href="http://aur.archlinux.org/packages.php?ID=33388" >AUR package for Perroquet 1.1.0</a>.
fr: Un paquet AUR est disponible ici: <a href="http://aur.archlinux.org/packages.php?ID=33388" >AUR package for Perroquet 1.1.0</a>.

source: Developement version
fr: Version de développement

source: An AUR package is available here: <a href="http://aur.archlinux.org/packages.php?ID=33389" >AUR package for Perroquet using Bazaar</a>
fr: Un paquet AUR est disponible ici : <a href="http://aur.archlinux.org/packages.php?ID=33389" >Paquet AUR pour Perroquet via Bazaar</a>

source: Using this package, Perroquet can be instable but will have the last features.
fr: En utilisant ce paquet, Perroquet peut présenter des instabilités mais comportera les dernières nouveautés.

source: Exercise Elephant dream
fr: Exercice Elephant dream

source: You can find here package for an exercise based on Elephant Dream : <a href="http://aur.archlinux.org/packages.php?ID=33400" >AUR package for Elephant Dream exercise</a>.
fr: Voici un paquet contenant le nécessaire pour créer un exercice sur le court-métrage Elephant Dream : <a href="http://aur.archlinux.org/packages.php?ID=33400" >Paquet AUR pour un exercice Elephant Dream</a>.

source: A perroquet 1.0.1 package for Mandriva is available for Mandriva 2010. You can also download it here: <a href="http://rpmfind.unity-linux.org/Mandriva%20Cooker%20-%20Contrib/perroquet-1.0.1-2mdv2010.1.noarch.html" >Perroquet 1.0.0 rpm </a>
fr: Un package pour perroquet 1.0.1 est disponible pour Mandriva 2010. Vous pouvez aussi le télécharger ici: <a href="http://rpmfind.unity-linux.org/Mandriva%20Cooker%20-%20Contrib/perroquet-1.0.1-2mdv2010.1.noarch.html" >Perroquet 1.0.0 rpm </a>

source: Others linux
fr: Autres linux

source: If you make a package for another distribution, send me it, I'll add it on this page.
fr: Si vous faites un paquet pour une autre distribution, envoyez le nous, il sera ajouté à cette page.

source: Source tarball
fr: Tarball source

source: The tarball containing the sources of installable software can be found here: <a href="http://launchpad.net/perroquet/1.1/1.1.1/+download/perroquet-1.1.1.tar.gz" >Tarball Perroquet 1.1.1</a>.
fr: Le tarball contenant les sources installables du logiciel peuvent se trouver ici : <a href="http://launchpad.net/perroquet/1.1/1.1.1/+download/perroquet-1.1.1.tar.gz" >Tarball pour Perroquet 1.1.1</a>.

source: Read INSTALL file to installation instructions.
fr: Lisez le fichier INSTALL pour les instructions d'installation.

source: It is possible that this link is not updated. Go to this page to see all downloads: <a href="https://launchpad.net/perroquet/+download" >Download page on launchpad</a>
fr: Il est possible que les liens ne soient pas à jour. Allez sur la page suivante pour voir tout les téléchargements disponibles: <a href="https://launchpad.net/perroquet/+download" >Page de téléchargement launchpad</a>;;

source: Bazaar repository
fr: Dépot bazaar

source: The code for the version of development and the means to recover it are available at the following address: <a href="https://code.launchpad.net/~perroquet-team/perroquet/trunk2" >Development branch of Perroquet</a>.
fr: Le code de la version de développement ainsi que le moyen de la récupérer sont disponibles à l'adresse suivante : <a href="https://code.launchpad.net/~perroquet-team/perroquet/trunk2" >Branche de développement de Perroquet</a>.

source: Select language
fr: Sélectionner la langue

source: Choose the new language :
fr: Choisissez la nouvelle langue :

source: Select
fr: Sélectionner

source: No language selected.
fr: Aucune langue sélectionnée.

source: Invalid language selected.
fr: La langue sélectionnée n'est pas valide.

source: Return to index
fr: Retour à l'accueil

source: Page not found
fr: Page introuvable

source: Login failed.
fr: L'authentification a échouée

source: Return to login page
fr: Retourner à la page de connexion

source: Login success.
fr: L'authentification a réussi.

source: Logout from '%s' success.
fr: La déconnexion depuis '%s' a réussi.

source: You are not logged.
fr: Vous n'êtes pas connecté.

source: Log In
fr: Connexion

source: Provide a valid OpenID.
fr: Fournissez un OpenID valide.

source: Login error.
fr: Erreur d'authentification.

source: Exercise list
fr: Liste d'exercices

source: Exercises list
fr: Liste des exercices

source: Language
fr: Langue

source: Word count
fr: Nombre de mots

source: Details
fr: Détails

source: Proposed exercised
fr: Exercices proposés

source: Current propositions
fr: Propositions courantes

source: Name:
fr: Nom :

source: Links:
fr: Liens :

source: Proposer:
fr: Proposeur :

source: Unknown state
fr: État inconnu

source: Waiting for processing
fr: En attente de traitement

source: Processing
fr: Traitement en cours

source: Accepted
fr: Accepté

source: State:
fr: État :

source: Old propositions
fr: Anciennes propositions

source: Perroquet works with exercises. An exercises in perroquet is the association of one or more media files and the corresponding subtitles files.
fr: Perroquet fonctionne avec des exercices. Un exercice dans Perroquet est l'association de un ou plusieurs fichiers multimédia et des fichiers de sous-titre correspondant.

source: There is various ways to get an exercise.
fr: Il y a plusieurs moyens d'obtenir un exercice.

source: Manual exercises creation
fr: Création manuelle d'exercices

source: If you have a media file with an audio track in the language you want to works and a subtitle in the same language, you can manually create an exercises.
fr: Si vous avez un fichier multimédia avec une piste audio dans la langue que vous souhaitez travailler et un sous-titre dans la même langue, vous pouvez manuellement créer un exercice.

source: Read the documentation to lear to create an exercise:
fr: Lisez la documentation pour apprendre à créer un exercice :

source: Online exercises repositories
fr: Dépôts d'exercices en ligne

source: Although perroquet works with every media file with a subtile file in the same language, a exercise manager in perroquet provide the access to an exercises's online database.
fr: Bien que perroquet fonctionne avec n'importe quel fichier multimédia avec un sous-titre dans la même langue, un gestionnaire d'exercice inclus dans Perroquet fournit l'accès à une base de données d'exercices en ligne.

source: The exercises manager (Edit>Exercise Manager) contains by default only one repository and this repository contains few exercises but no configuration is needed for these exercises.
fr: Le gestionnaire d'exercices (Édition > Gestionnaire d'exercices), contient par défaut seulement un dépôt et ce dépôt ne contient que quelques exercices mais aucune configuration n'est nécessaire pour ces exercices.

source: Your help is welcome to fill the repositories with others exercises:
fr: Votre aide est bienvenue pour remplir le dépôt avec d'autres exercices:

source: Propose a new exercise or an update of an existing exercise.
fr: Proposer un nouvel exercice ou une mise à jour d'un exercice existant.

source: Add new repository
fr: Ajouter un nouveau dépôt

source: My proposed exercises
fr: Mes propositions d'exercices

source: Propose new exercise
fr: Proposer un nouvel exercice

source: Return to exercises index.
fr: Revenir à l'accueil des exercices

source: Propose an exercise permit to help to full the official perroquet exercises's repository.
fr: Proposer un exercice permet d'aider à remplir le dépôt d'exercices officiel de Perroquet.

source: Before beeing accessible from the exercise manager, the proposed exercise will be examinated. Also, be sure that you use free licenced file as public domain, CC-by-sa, GPL, Free Art, ...
fr: Avant d'être accessible depuis le gestionnaire d'exercices, l'exercice proposé sera examiné. D'autre part, assurez-vous que vous utilisez des fichiers sous licence libre comme le domaine public, CC-By-sa, GPL, Free Art, ...

source: Short description:
fr: Description courte :

source: Others informations : links to ressources, comments, authors, licence, ... :
fr: Autres informations : liens vers des ressources, commentaires, auteurs, licence, ... :

source: Propose
fr: Proposer

source: Propose an exercise
fr: Proposer un exercice

source: Add new exercise
fr: Ajouter un nouvel exercice

source: Add a new exercise
fr: Ajouter un nouvel exercice

source: Group:
fr: Groupe :

source: Word count:
fr: Nombre de mots :

source: Languague (en, fr, ...):
fr: Langue (en, fr, ...) :
